// Task 1 ============================================
/*  Дан массив со числами. Удалите из него числа, состоящие более чем из трех цифр.*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*   Дано число, например, вот такое: let num = 12345; Проверьте, что все цифры этого числа
          больше нуля.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3============================================
/*  Дан некоторый массив, например, вот такой: [123, 456, 789] Слейте все элементы этого
          массива в один массив, разбив их посимвольно: [1, 2, 3, 4, 5, 6, 7, 8, 9]*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4============================================
/*  Дан следующая структура: let data = [ { 1: 11, 2: 12, 3: 13, }, { 1: 21, 2: 22, 3: 23, },
          { 1: 24, 2: 25, 3: 26, }, ]; Найдите сумму элементов этой структуры.*/

let a4 = '2025-12-31';
function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);
