// Task 1 ============================================
/* Дано некоторое число. Проверьте, что цифры этого числа расположены по возрастанию.*/
let a1 = 'на дворе трава, на  траве дрова';

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*  Дан массив: [1, '', 2, 3, '', 5] Удалите из массива все пустые строки.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3 ============================================
/* Дан массив: [ [2, 1, 4, 3, 5], [3, 5, 2, 4, 1], [4, 3, 1, 5, 2], ] Отсортируйте элементы в
          каждом подмассиве.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4 ============================================
/*   Даны два массива:

let arr1 = [1, 2, 3];
let arr2 = [1, 2, 3, 4, 5];
Удалите из большего массива лишние элементы с конца так, чтобы длины массивов стали одинаковыми.*/
let a4 = [1, 2, 3, 4, 5, 6];

function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);
