// Task 1 ============================================
/*  Дана некоторая строка с буквами и цифрами. Получите массив позиций всех цифр из этой
          строки*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*   Дан массив с некоторыми числами, например, вот такой: [123, 456, 789] Напишите код,
          который перевернет числа в этом массиве по следующему принципу: [321, 654, 987]*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3============================================
/*  Дана некоторая строка с числом: '1234567' Отделите тройки цифр пробелами, начиная с конца
          числа. В нашем случае должно получится следующее: '1 234 567'*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4============================================
/*  Дана некоторая строка: 'AbCdE' Смените регистр букв этой строки на противоположный. В
 нашем случае должно получится следующее: 'aBcDe'*/

let a4 = '2025-12-31';
function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);

// Task 5============================================
/*  Дан некоторый массив с числами, например, вот такой: [1, 2, 3, 4, 5, 6] Слейте пары
          элементов вместе: [12, 34, 56]*/

let a5 = '2025-12-31';
function t5() {}
document.querySelector('.b-5').addEventListener('click', t5);

// Task 6============================================
/*  Дана некоторая строка со словами: 'aaa bbb ccc eee fff' Сделайте заглавным первый символ  каждого 
второго слова в этой строке. В нашем случае должно получится следующее: 'aaa Bbb  ccc Eee fff'*/

let a6 = '2025-12-31';
function t6() {}
document.querySelector('.b-6').addEventListener('click', t6);
