// Task 1 ============================================
/* 'a bc def ghij' Переведите в верхний регистр все подстроки, в которых количество букв
          меньше или равно трем. В нашем случае должно получится следующее: 'A BC DEF ghij'*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/* Дан символ. Узнайте, в каком регистре этот символ - в верхнем или нижнем.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3============================================
/*   Дано некоторое число, например, такое: 123789 Удалите из этого числа все нечетные цифры. В
  нашем случае получится такой результат: 28*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);
