// Task 1 ============================================
/*  Дано некоторое число: 123456 Найдите сумму пар цифр этого числа. В нашем случае имеется
  ввиду следующее: 12 + 34 + 56*/
let a1 = [1, 2, 56, -6, 7, -2, -8, 12, -45, 78, -12, -45, -8, 41, 15, 18, -3];

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*  Дан массив с числами:

[1, 2, 3, 4, 5]
Выведите в консоль элементы этого массива в обратном порядке.*/
let a2 = [1, 2, 56, -6, 7, -2, -8, 12, -45, 78, -12, -45, -8, 41, 15, 18, -3];

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);
