// Task 1 ============================================
/*  Сделайте функцию, которая параметром будет принимать число и возвращать сумму его цифр.*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/* Сделайте функцию, которая параметром будет принимать число и удалять из него нули.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3 ============================================
/*    Сделайте функцию, которая будет возвращать сколько дней прошло или осталось до заданной
          даты в году, в зависимости от того, была уже эта дата или нет.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4 ============================================
/*  Сделайте функцию, которая параметром будет год и проверять, високосный он или нет.*/

function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);
// Task 5 ============================================
/*  Сделайте функцию, которая параметром будет год и проверять, високосный он или нет.*/

function t5() {}
document.querySelector('.b-5').addEventListener('click', t5);

// Task 6 ============================================
/*  Сделайте функцию, которая будет возвращать сколько дней осталось до конца текущего месяца.*/

function t6() {}
document.querySelector('.b-6').addEventListener('click', t6);

// Task 7 ============================================
/*  Сделайте функцию, которая вернет предыдущий, текущий и следующий дни недели словом в виде
          следующего объекта: { next: 'пн', curr: 'вс', prev: 'сб', }*/

function t7() {}
document.querySelector('.b-7').addEventListener('click', t7);
