// Task 1 ============================================
/*           Выведите в консоль все числа в промежутке от 10 до 1000, у которых первая цифра четная.*/
let a1 = 'asf5df8r7bn9';

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*  Дан некоторый массив, например, вот такой: [1, 2, 3, 4, 5, 6] Поменяйте местами пары
      элементов этого массива: [2, 1, 4, 3, 6, 5].*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3 ============================================
/*  Дан следующий объект: let obj = { 1: { 1: 11, 2: 12, 3: 13, }, 2: { 1: 21, 2: 22, 3: 23,}, 3: { 1: 24, 2: 25, 3: 26, }, } Найдите сумму элементов этого объекта.*/
let num3 = 32459866721;
function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);
