// Task 1 ============================================
/* Дана строка со словами. Отсортируйте слова в алфавитном порядке.'*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/* Дано число. Получите массив делителей этого числа.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3============================================
/*  Даны два числа. Получите массив общих делителей этих чисел.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4 ============================================
/*  Дано число. Проверьте, что у этого числа есть только один делитель, кроме него самого и
          единицы.*/

function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);

// Task 5============================================
/* Через запятую написаны числа. Получите максимальное из этих чисел.*/

function t5() {}
document.querySelector('.b-5').addEventListener('click', t5);

// Task 6============================================
/*   Дан массив с числами. После каждого однозначного числа вставьте еще такое же.*/

function t6() {}
document.querySelector('.b-6').addEventListener('click', t6);

// Task 7 ============================================
/* Дана строка. Удалите из нее все гласные буквы*/

function t7() {}
document.querySelector('.b-7').addEventListener('click', t7);

// Task 8============================================
/* Дана строка. Сделайте заглавной последнюю букву каждого слова в этой строке.*/

function t8() {}
document.querySelector('.b-8').addEventListener('click', t8);

// Task 9============================================
/*  Дан следующая структура: let data = [ { 1: [1, 2, 3], 2: [1, 2, 3], 3: [1, 2, 3], }, { 1:
          [1, 2, 3], 2: [1, 2, 3], 3: [1, 2, 3], }, { 1: [1, 2, 3], 2: [1, 2, 3], 3: [1, 2, 3], },
          ]; Найдите сумму элементов этой структуры.*/

function t9() {}
document.querySelector('.b-9').addEventListener('click', t9);
