// Task 1 ============================================
/*  Дан массив. Сделайте так, чтобы в нем каждый элемент повторился два раза..*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*   Дан массив и число. Оставьте в массиве только те числа, которые являются делителями
   заданного числа.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3============================================
/*  Даны два числа. Получите массив цифр, которые есть и в одном, и во втором числе.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4============================================
/*   Дано число. Получите массив позицией всех цифр 3 в этом числе, за исключением первой и
          последней.*/

let a4 = '2025-12-31';
function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);

// Task 5============================================
/*  Дан массив со числами. Оставьте в нем числа, состоящие из разных цифр, а остальные
 удалите.*/

function t5() {}
document.querySelector('.b-5').addEventListener('click', t5);

// Task 6============================================
/*   Дан массив: [ [1, 2, 3], [4, 5, 6], [7, 8, 9], ] Слейте элементы этого массива в один
 одномерный массив: [1, 2, 3, 4, 5, 6, 7, 8, 9]*/

let a6 = '2025-12-31';
function t6() {}
document.querySelector('.b-6').addEventListener('click', t6);
