// Task 1 ============================================
/* Дан массив со словами. Удалите из него слова, состоящие более чем из трех символов.*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*  Дано некоторое число: 1357 Проверьте, что все цифры этого числа являются нечетными.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3============================================
/*   Дано некоторое слово: 'abcba' Проверьте, что это слово читается одинаково с любой стороны.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);

// Task 4============================================
/*  Дан массив:

[
	[
		[11, 12, 13],
		[14, 15, 16],
		[17, 17, 19],
	],
	[
		[21, 22, 23],
		[24, 25, 26],
		[27, 27, 29],
	],
	[
		[31, 32, 33],
		[34, 35, 36],
		[37, 37, 39],
	],
]
Найдите сумму элементов этого массива.*/

function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);
