// Task 1 ============================================
/*  Дана строка с буквами. Проверьте, что в этой строке не более двух заглавных букв.*/
let a1 = 'на дворе трава, на  траве дрова';

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*   Дана некоторая строка: '1 22 333 4444 22 5555 1' Удалите из этой строки все подстроки, в
 которых количество символов больше трех. В нашем случае должно получится следующее: '1 22 333 22 1'.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3 ============================================
/*  Даны два массива: let arr1 = [1, 2, 3]; let arr2 = ['a', 'b', 'c']; Слейте эти массивы в
          новый массив следующим образом: [1, 2, 'a', 'b', 'c', 3]*/
let a3 = [3, 12, 4, 2, 1, 0, 6, 5, 4, 7, 9, 56, 45, 78, 98, 12, 13, 14, 15, 56, 18, 19];

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);
