// Task 1 ============================================
/*  Дан текст со словами. Запишите в массив все слова, начинающиеся на букву 'a'.*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*  Дан массив с числами. Оставьте в нем только те числа, которые делятся на 5.*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3 ============================================
/*  Дан массив с числами. Оставьте в нем только те числа, которые содержат цифру ноль.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);
// Task 4 ============================================
/* Дан массив со числами. Проверьте, что в нем есть число, содержащее в себе цифру 3.*/

function t4() {}
document.querySelector('.b-4').addEventListener('click', t4);

// Task 5============================================
/*  Дано некоторое число: 35142 Отсортируйте цифры этого числа. В нашем случае должно
          получится следующее: 12345*/

function t5() {}
document.querySelector('.b-5').addEventListener('click', t5);

// Task 6 ============================================
/*  Напишите программу, которая сформирует следующую строку: '-1-2-3-4-5-'*/

function t6() {}
document.querySelector('.b-6').addEventListener('click', t6);

// Task 7 ============================================
/*   Дан следующий объект: let obj = { 1: { 1: { 1: 111, 2: 112, 3: 113, }, 2: { 1: 121, 2:
          122, 3: 123, }, }, 2: { 1: { 1: 211, 2: 212, 3: 213, }, 2: { 1: 221, 2: 222, 3: 223, }, },
          3: { 1: { 1: 311, 2: 312, 3: 313, }, 2: { 1: 321, 2: 322, 3: 323, }, }, } Найдите сумму
          элементов этого объекта.*/

function t7() {}
document.querySelector('.b-7').addEventListener('click', t7);
