// Task 1 ============================================
/*  Дана некоторая строка, например, вот такая: '023m0df0dfg0' Получите массив позиций всех
          нулей в этой в строке.*/

function t1() {}
document.querySelector('.b-1').addEventListener('click', t1);

// Task 2============================================
/*  Дана некоторая строка: 'abcdefg' Удалите из этой строки каждый третий символ. В нашем
          случае должно получится следующее: 'abdeg'*/

function t2() {}
document.querySelector('.b-2').addEventListener('click', t2);

// Task 3 ============================================
/*  Дан некоторый массив, например, вот такой: [1, 2, 3, 4, 5, 6] Поделите сумму элементов,
          стоящих на четных позициях, на сумму элементов, стоящих на нечетных позициях.*/

function t3() {}
document.querySelector('.b-3').addEventListener('click', t3);
