// Task 1 ============================================
/*  Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.*/
let a1 = 5;

function t1() {
  if (a1 <= 0) {
    console.log('число отрицательное');
  } else {
    console.log('число  положительное');
  }
}
t1();

// Task 2============================================
/*  Дана строка. Выведите в консоль длину этой строки.*/
let a2 = 'some text';

function t2() {
  console.log(a2.length);
}
t2();

// Task 3 ============================================
/*  Дана строка. Выведите в консоль последний символ строки.*/
let a3 = 'some text';

function t3() {
  console.log(a3.charAt(a2.length - 1));
}
t3();

// Task 1 ============================================
/*  Дано число. Проверьте, четное оно или нет.*/
let a4 = 5;

function t4() {
  if (a4 % 2 == 0) {
    console.log('число четное');
  } else {
    console.log('число  нечетное');
  }
}
t4();

// Task 1 ============================================
/* Даны два слова. Проверьте, что первые буквы этих слов совпадают.*/
let str51 = 'some text';
let str52 = 'string 5';

function t5() {
  if (str51.charAt(0) == str52.charAt(0)) {
    console.log('true');
  } else {
    console.log('false');
  }
}
t5();

// Task 1 ============================================
/*   Дано слово. Получите его последнюю букву. Если слово заканчивается на мягкий знак, то
          получите предпоследнюю букву.*/
let str6 = 'посадобль';

function t6() {
  if (str6.charAt(str6.length - 1) == 'ь') {
    console.log(str6.charAt(str6.length - 2));
  } else {
    console.log(str6.charAt(str6.length - 1));
  }
}
t6();
